Repository: OlivierGeorgeon/IOS-AImergence
Catalog: */AImergence2/*.lproj/Localizable.strings
Languages: ru

source: Level
ru: Уровень

source: Cancel
ru: Назад

source: You must reach the score of 10
ru: Вы должны набрать 10 очков для доступа к режиму воспроизведения уровня.

source: Excellent 0
ru: Отлично! Вы прошли уровень 0! Теперь вам доступно воспроизведение этого уровня. Он показывает возможную интерпретацию того, что вы сделали и позволяет открыть новые шаблоны. Коснитесь каждой команды хотя бы один раз, чтобы включить кнопку «ОК» перед закрытием этого окна.

source: Excellent 1
ru: Сейчас вы прошли уровень 1! Существует две модели взаимодействия, которые могут решить этот уровень. Перед закрытием этого окна попробуйте выполнить различные последовательности команд, чтобы узнать, можете ли вы найти эти два шаблона.

source: Excellent 2
ru: Превосходно! Вы завершили Уровень 2! Прокрутите трассировку за этим окном, чтобы увидеть, что вы сделали, и повторите последовательность, нажав последовательные взаимодействия в трассировке, пока это окно открыто.

source: Excellent 3
ru: Обратите внимание, что little Al предложит следующую команду при нажатии на взаимодействие в трассировке. Попробуйте это на трассе, в которой на каждом повороте команды разные. Предлагаемая команда не всегда подходит, но трассировка помогает определить, какие команды производят какие взаимодействия в каких ситуациях.

source: Excellent 4
ru: Поздравляем! Вы прошли уровень 4! Нажмите успешную последовательность из четырех взаимодействий на трассе, чтобы понять, почему неприятные взаимодействия необходимы для приятных результатов.

source: Excellent 5
ru: Здесь вы можете более четко видеть, что команда наблюдения (по умолчанию квадрат) позволяет Little AI наблюдать за плиткой, не меняя ее, в отличие от двух других команд.

source: Excellent 6
ru: Убедитесь, что цвет соответствует геометрии плитки, с которой Little AI взаимодействует: зеленый для округлых сторон и красный для плоских сторон. Цвета, которые вы выбрали, должны отражать физические свойства мира. Little AI использует эти знания, чтобы жить счастливо!

source: Excellent 7
ru: Браво! Когда вы снова воспроизводите последовательность взаимодействий, нажимая их в трассировке, вы повторно выполняете программу, которую вы ранее узнали. Таким образом автономный робот может программировать себя!

source: Excellent 8
ru: На этом уровне вы можете видеть, что неинформативная команда переворачивает плитку, не сообщая вам, с какой она стороны. Оставьте взаимодействие, созданное этой командой, белым, потому что оно не передает никакой информации о физическом состоянии мира.

source: Excellent 14
ru: Во время игры вы можете произвольно интерпретировать направления (слева или справа) команд вращения. Эта интерпретация может быть инвертирована из того, что вы видите в режиме воспроизведения, но это нормально. Реальный мир, если он существует, может полностью отличаться от того, каким вы его видите.

source: Excellent 16
ru: Вы можете выиграть 16-й уровень, прежде чем выяснить точное значение каждой команды и взаимодействия. Пространственное представление, предлагаемое режимом воспроизведения, поможет вам исправить несоответствия в вашем понимании.

source: Excellent 100
ru: Вы должны нажать каждую команду перед закрытием этого окна, чтобы включить кнопку «Ок».

source: Drag the 3D scene to move the camera
ru: Перетащите 3D вид, чтобы изменить угол обзора.

source: Double tap to swap cameras.
ru: Дважды нажмите на 3D-вид для замены точек обзора.

source: Explore your environment
ru: Исследуйте среду, прежде чем перейти на следующий уровень.

source: Tap an event to replay its command
ru: Прокрутите фоновое окно, чтобы просмотреть последние взаимодействия. Коснитесь взаимодействий, чтобы воспроизвести ряд команд.

source: Replay without bumping
ru: Коснитесь взаимодействий, чтобы воспроизвести ряд команд. Повторите ряд команд, которые позволяют перемещаться и поворачиваться без столкновений.

source: You won!
ru: Яху! Вы прошли Little AI! Следите за обновлениями, чтобы получить еще более захватывающие уровни в ближайшие месяцы! (Добровольно разработанные или основанные вашими пожертвованиями.)

source: Please login to Game Center
ru: Чтобы просмотреть таблицу лидеров, создайте учетную запись Game Center в системных настройках

source: Thank you!
ru: Большое спасибо за вашу помощь!

source: 0 moves
ru: 0 поворотов

source: Won in
ru: Выиграли

source: moves
ru: повороты

source: command
ru: Нажмите команды, чтобы начать играть

source: score
ru: Достигните 10 очков

source: instruction
ru: Нажмите, чтобы прочитать инструкции

source: replay
ru: Нажмите, чтобы открыть окно

source: rank
ru: Нажмите, чтобы посмотреть ваш рейтинг

source: menu
ru: Нажмите, чтобы увидеть или скрыть меню

source: drag
ru: Перетащите робота для переключения уровней

source: redo
ru: Коснитесь взаимодействия для повторения команы

source: shape
ru: Нажмите и удерживайте, чтобы изменить фигуры

source: color
ru: Нажмите и удерживайте, чтобы изменить цвета

source: level
ru: Нажмите, чтобы увидеть список уровней

source: sequence
ru: Нажмите, чтобы воспроизвести следующую команду в трассировке

source: resume
ru: Перетащите, чтобы продолжить игру

source: support
ru: Поддержать Little AI

source: sound
ru: Нажмите, что бы включить/выключить звук

source: instructionAgain
ru: Нажмите «Ок» в окне инструкции, чтобы подтвердить

source: replayAgain
ru: Нажмите каждую команду пока открыто окно воспроизведения, а затем Ок

source: match
ru: Нажмите, чтобы найти партнера

source: group
ru: Перетащите для доступа к большему количеству уровней

source: Disposed from memory
ru: Удалено из памяти

source: Ready
ru: Готово
