Repository: OlivierGeorgeon/IOS-AImergence
Catalog: AImergence2/*.lproj/Localizable.strings
Languages: fr

source: Level
fr: Niveau

source: Cancel
fr: Retour

source: You must reach the score of 10
fr: Vous devez atteindre le score de 10 pour pouvoir accéder au mode "replay" de ce niveau.

source: Excellent 0
fr: Bravo ! Vous avez gagné le niveau 0 ! Vous avez maintenant accès au mode "replay" qui vous propose une interprétation possible de ce que vous avez fait. Pressez au moins une fois chaque commande pour activer le bouton Ok AVANT de fermer cette fenêtre.

source: Excellent 1
fr: Parfait ! Vous avez gagné le niveau 1 ! Il y a deux comportements qui vous permettent de gagner ce niveau. Essayez différentes séquences de commandes pour voir si vous pouvez trouver ces deux comportements avant de fermer cette fenêtre.

source: Excellent 2
fr: Excellent ! Vous avez terminé le niveau 2 ! Nous vous encourageons à utiliser la trace pour découvrir des nouveaux comportements. Essayez de rejouer une suite de commandes gagnante en appuyant sur les interactions dans la trace.

source: Excellent 3
fr: Remarquez que Little AI suggère la prochaine commande quand vous appuyez dans la trace. Essayez avec une trace qui contient des commandes différentes à chaque coup. La commande suggérée n'est pas toujours la bonne, mais la trace vous aide à retrouver quelles commandes produisent quelles interactions dans quelles situations.

source: Excellent 4
fr: Félicitations ! Vous avez gagné le niveau 4 ! Appuyez successivement sur quatre interactions consécutives formant une séquence gagnante dans la trace pour voir pourquoi les interactions désagréables sont nécessaires pour obtenir des interactions agréables.

source: Excellent 5
fr: Maintenant, vous pouvez voir plus clairement que la commande observationnelle (par défaut le carré) permet à Little AI d'observer un objet sans le transformer, contrairement aux deux autres commandes.

source: Excellent 6
fr: Vérifiez que les couleurs des interactions correspondent à la géométrie de l'objet avec lequel Little AI interagit: vert pour les faces arrondies et rouge pour les faces plates. Les couleurs que vous avez choisies devraient refléter ces propriétés physiques du monde. Little AI exploite ce savoir pour vivre une vie heureuse !

source: Excellent 7
fr: Merveilleux! Quand vous rejouez des séquences d'interaction en appuyant dessus dans la trace, vous ré-exécutez un programme que vous avez précédemment appris. C'est comme ça qu'un robot autonome peut se programmer lui-même !

source: Excellent 8
fr: Dans ce niveau, vous pouvez voir que la commande non informative bascule l'objet sans vous informer du sens dans lequel il est. Laissez l'interaction produite par cette commande en blanc car elle ne transmet aucune information sur l'état physique du monde.

source: Excellent 14
fr: Pendant le jeu, vous pouvez interpréter arbitrairement les directions des commandes de rotation. Une fois sur deux, votre interprétation sera à l'inverse de ce que vous observerez dans le mode replay mais ce n'est pas grave. Le monde réel, s'il existe, est peut-être entièrement inversé par rapport à ce que vous croyez !

source: Excellent 16
fr: Vous pouvez gagner le niveau 16 avant de comprendre la signification de chaque commande et interaction. La représentation spatiale offerte par le mode imaginare vous aide à corriger les contradictions dans ce que vous croyiez avoir compris.

source: Drag the 3D scene to move the camera
fr: Glissez la scène 3D pour changer l'angle de vue.

source: Double tap to swap cameras.
fr: Appuyez deux fois sur la scène 3D pour passer d'un point de vue à un autre.

source: Explore your environment
fr: Explorez votre environnement avant de passer au niveau suivant.

source: Tap an event to replay its command
fr: Scrollez la fenêtre d'arrière plan pour revoir les interactions passées. Appuyez sur les interactions passées pour rejouer des séquences de commandes.

source: Replay without bumping
fr: Appuyez sur les interactions passées pour rejouer des séquences de commandes. Rejouez une séquence de commandes qui permet de se déplacer et tourner sans se cogner.

source: You won!
fr: Youpi ! Vous avez terminé Little AI ! Surveillez les mises à jour pour obtenir des niveaux encore plus intéressants dans les mois à venir ! (Développés bénévolement ou financés par vos dons.)

source: Please login to Game Center
fr: Pour voir le classement, créez votre compte Game Center dans les paramètres système

source: Thank you!
fr: Merci beaucoup pour votre soutien !

source: 0 moves
fr: 0 coups

source: Won in
fr: Gagné en

source: moves
fr: coups

source: command
fr: Pressez les commandes/pour jouer

source: score
fr: Atteignez le/score de 10

source: instruction
fr: Appuyez pour/lire les instructions

source: explore
fr: Appuyez pour ouvrir/la fenêtre "replay"

source: rank
fr: Appuyez pour voir/ votre classement

source: menu
fr: Appuyez pour déployer/ou masquer le menu

source: drag
fr: Glissez le robot pour/changer de niveau

source: redo
fr: Pressez une interaction/pour rejouer sa commande

source: shape
fr: Maintenez pressé/pour changer les formes

source: color
fr: Maintenez pressé/pour changer les couleurs

source: level
fr: Appuyez pour voir le/tableau des niveaux

source: sequence
fr: Appuyez plusieurs fois/pour rejouer une série

source: resume
fr: Glissez pour/reprendre le jeu

source: support
fr: Soutenez Little AI

source: sound
fr: Appuyez pour activer/ou désactiver les sons

source: instructionAgain
fr: Pressez Ok dans la fenêtre/d'instructions pour acquiter

source: exploreAgain
fr: Pressez les commandes/avec la fenêtre replay/OUVERTE, puis Ok

source: Disposed from memory
fr: Effacé de la mémoire
